
#include<stdio.h>

int main()
{

	return 0;
}




//int main()
//{
//	int a = 5;
//	//00000000 00000000 00000000 00000101
//	printf("a的值为：%d\n", a);
//
//
//	float b = (float)a;
//	printf("b的值为：%f\n", b);
//
//	float* c = (float*)&a;
//	//将内存里的补码以浮点数的规则读
//	//S:0  E:00000000  M:0000000 00000000 00000101
//	printf("c的值为：%f\n", *c);
//
//	*c = 5.0;
//	//101.0 = 1.010*2^(2) 2+127 = 129
//	//以浮点数的规则存数据
//	//S: 0  E: 10000001 M:0000000 00000000 00000010
//
//	printf("a的值为:%d\n", a);
//	printf("a的值为:%f\n", *c);
//
//
//
//	return 0;
//}

//int main()
//{
//	int i = 20;
//	unsigned int j = -10;
//	printf("%d\n", i + j);
//	return 0;
//}

//使用的是原码的话
//20
// 00000000 00000000 00000000 00010100
//-10
// 10000000 00000000 00000000 00001010
// 10000000 00000000 00000000 00011110 相加，为-30

//使用的是补码的话
//20
// 00000000 00000000 00000000 00010100
//-10
// 11111111 11111111 11111111 11110110
//100000000 00000000 00000000 00001010 最前面的1越界，所以直接丢掉，转化为原码为10